# İleri Birleştirme İşlemleri

In [2]:
import numpy as np
import pandas as pd

## Birebir Birleştirme:
Burada a ve b dataframe'leri birleştirme işlemini  **.merge(a,b)** metoduyla yaparız.<br>
Pandas hangi değişkene göre birleştireceğini kendisi ayarlayabilir.<br>
İsteğe bağlı parantez içi argüman olarak **on=değişken_adı** yazarak birleştirme işlemini yapabiliriz.

In [3]:
df1 = pd.DataFrame({"Çalışanlar": ["Mert","Fatih","Murat","Yavuz"],
                    "Bölüm": ["Mühendislik","Mühendislik","İK","Finans"]})

df2 = pd.DataFrame({"Çalışanlar": ["Mert","Fatih","Murat","Yavuz"],
                    "İşe Giriş": [2020,1453,2016,1500]})

In [4]:
df1

  Çalışanlar        Bölüm
0       Mert  Mühendislik
1      Fatih  Mühendislik
2      Murat           İK
3      Yavuz       Finans

In [5]:
df2

  Çalışanlar  İşe Giriş
0       Mert       2020
1      Fatih       1453
2      Murat       2016
3      Yavuz       1500

In [6]:
df3 = pd.merge(df1,df2)

In [7]:
pd.merge(df1,df2, on="Çalışanlar")

  Çalışanlar        Bölüm  İşe Giriş
0       Mert  Mühendislik       2020
1      Fatih  Mühendislik       1453
2      Murat           İK       2016
3      Yavuz       Finans       1500

## Çoktan Teke Birleştirme:

In [15]:
df4 = pd.DataFrame({"Bölüm" : ["Mühendislik", "İK", "Finans"],
                    "Müdür" : ["Mehmet", "Ali", "Kemal"]})

In [16]:
df4

         Bölüm   Müdür
0  Mühendislik  Mehmet
1           İK     Ali
2       Finans   Kemal

In [20]:
df6 = pd.merge(df3,df4, on="Bölüm")

## Çoktan Çoka Birleştirme:

In [24]:
df5 = pd.DataFrame({"Bölüm" : ["Finans","Finans","Mühendislik","Mühendislik","İK","İK"],
                    "Yetenekler" : ["Matematik", "Excel", "Kodlama","Linux","Excel", "Yönetim"]})
df5

         Bölüm Yetenekler
0       Finans  Matematik
1       Finans      Excel
2  Mühendislik    Kodlama
3  Mühendislik      Linux
4           İK      Excel
5           İK    Yönetim

In [25]:
pd.merge(df6,df5, on="Bölüm")

  Çalışanlar        Bölüm  İşe Giriş   Müdür Yetenekler
0       Mert  Mühendislik       2020  Mehmet    Kodlama
1       Mert  Mühendislik       2020  Mehmet      Linux
2      Fatih  Mühendislik       1453  Mehmet    Kodlama
3      Fatih  Mühendislik       1453  Mehmet      Linux
4      Murat           İK       2016     Ali      Excel
5      Murat           İK       2016     Ali    Yönetim
6      Yavuz       Finans       1500   Kemal  Matematik
7      Yavuz       Finans       1500   Kemal      Excel